* DONE FIX Docs
  CLOSED: [2021-09-17 Fr 17:39]
  - State "DONE"       from "TODO"       [2021-09-17 Fr 17:39]
* DONE Translate scheduler into lisb code
  CLOSED: [2021-09-19 So 18:27]
  - State "DONE"       from "NEXT"       [2021-09-19 So 18:27]
  :LOGBOOK:
  CLOCK: [2021-09-19 So 10:28]--[2021-09-19 So 10:53] =>  0:25
  CLOCK: [2021-09-18 Sa 09:34]--[2021-09-18 Sa 09:59] =>  0:25
  :END:
* DONE Refactor core funs
  CLOSED: [2021-09-20 Mo 14:06]
  - State "DONE"       from "TODO"       [2021-09-20 Mo 14:06]
* DONE Write specs
  CLOSED: [2021-09-20 Mo 14:07]
  - State "DONE"       from "TODO"       [2021-09-20 Mo 14:07]
* DONE Find out why if-sub translates to ELSE-IF and not IF
  CLOSED: [2021-09-20 Mo 14:06]
  - State "DONE"       from "TODO"       [2021-09-20 Mo 14:06]
* DONE Fix up util typedefs
  CLOSED: [2021-11-17 Mi 08:45]
  - State "DONE"       from "TODO"       [2021-11-17 Mi 08:45]
* DONE Write more predicates
  CLOSED: [2021-11-17 Mi 08:45]
  - State "DONE"       from "TODO"       [2021-11-17 Mi 08:45]
* DONE Improve specs
  CLOSED: [2021-11-17 Mi 08:45]
  - State "DONE"       from "TODO"       [2021-11-17 Mi 08:45]
* DONE Operations
  CLOSED: [2021-11-17 Mi 08:45]
  - State "DONE"       from "TODO"       [2021-11-17 Mi 08:45]
* DONE Update Readme
  CLOSED: [2021-11-24 Mi 21:48]
  - State "DONE"       from "TODO"       [2021-11-24 Mi 21:48]
* DONE Update to new lisb version
  CLOSED: [2021-11-24 Mi 21:48]
  - State "DONE"       from "TODO"       [2021-11-24 Mi 21:48]
* DONE Finish Backend for scheduler
  CLOSED: [2021-11-24 Mi 21:49]
  - State "DONE"       from "TODO"       [2021-11-24 Mi 21:49]
* DONE Memoize Backend
  CLOSED: [2021-11-24 Mi 21:49]
  - State "DONE"       from "TODO"       [2021-11-24 Mi 21:49]
*
* DONE [#A] Properly seperate Expression handling by Type
CLOSED: [2021-12-01 Mi 20:09]
- State "DONE"       from "TODO"       [2021-12-01 Mi 20:09]
* DONE [#A] Constants and Properties
CLOSED: [2021-12-01 Mi 20:09]
- State "DONE"       from "TODO"       [2021-12-01 Mi 20:09]
* DONE [#B] Handle Type Definitions properly
CLOSED: [2021-12-01 Mi 20:10]
- State "DONE"       from "TODO"       [2021-12-01 Mi 20:10]
* DONE [#B] Exists and for all quantifiers
CLOSED: [2021-12-09 Do 12:38]
- State "DONE"       from "TODO"       [2021-12-09 Do 12:38]
* DONE [#A] Abstract out the binding concept from operations
CLOSED: [2021-12-09 Do 12:38]
- State "DONE"       from "TODO"       [2021-12-09 Do 12:38]
* DONE [#A] Implement Re-translation into set from bitvector
CLOSED: [2021-12-12 So 16:01]
- State "DONE"       from "TODO"       [2021-12-12 So 16:01]

* DONE [#A] Support for Relations
CLOSED: [2021-12-19 So 12:16]
- State "DONE"       from "TODO"       [2021-12-19 So 12:16]
:LOGBOOK:
CLOCK: [2021-11-26 Fr 13:50]--[2021-11-26 Fr 14:16] =>  0:26
CLOCK: [2021-11-26 Fr 13:07]--[2021-11-26 Fr 13:32] =>  0:25
CLOCK: [2021-11-26 Fr 12:37]--[2021-11-26 Fr 13:02] =>  0:25
CLOCK: [2021-11-26 Fr 12:06]--[2021-11-26 Fr 12:31] =>  0:25
:END:
** DONE Function Declarations
CLOSED: [2021-12-02 Do 12:26]
- State "DONE"       from "TODO"       [2021-12-02 Do 12:26]
** DONE Relation operations
CLOSED: [2021-12-15 Mi 21:09]
- State "DONE"       from "TODO"       [2021-12-15 Mi 21:09]
** DONE Standardize Matrix form
CLOSED: [2021-12-15 Mi 21:09]
- State "DONE"       from "TODO"       [2021-12-15 Mi 21:09]
** DONE Domain and Range restriction
CLOSED: [2021-12-19 So 12:16]

- State "DONE"       from "TODO"       [2021-12-19 So 12:16]
* TODO [#B] Update Tests
- [ ] dsl
- [ ] expressions
- [ ] predicates
- [ ] core
- [ ] backend
* TODO [#C] Try to get the nxt running?
* TODO [#C] Refactor (only after the Tests are done)
